rodrigocm1995/STM32Projects/NUCLEO-F303_PortManipulation/Core/Src/main1.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct 
{
  GPIO_TypeDef * Port;
  uint16_t Pin;
} GPIO_PortMap_HandleTypeDef;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LEDS_QTY 6U
#define DURANTION_SEQUENCE_1 100U
#define SEQUENCE_QTY 3U
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
const GPIO_PortMap_HandleTypeDef ledsArray[LEDS_QTY] = {
    {LED1_GPIO_Port, LED1_Pin},
    {LED2_GPIO_Port, LED2_Pin},
    {LED3_GPIO_Port, LED3_Pin},
    {LED4_GPIO_Port, LED4_Pin},
    {LED5_GPIO_Port, LED5_Pin},
    {LED6_GPIO_Port, LED6_Pin}
};
uint32_t lastBlinkTick = 0;
uint32_t lastTick = 0;
volatile uint8_t sequence = 0;
uint8_t currentState = 0;
uint8_t previousState = 0;
uint8_t currentLed = 0;
uint8_t previousLed = 0;
uint8_t ledDirection = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void Sequence_Handler_FSM(void);
void Sequence_1(void);
void Sequence_2(void);
void Sequence_3(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  for (uint8_t i = 0; i < LEDS_QTY; i++)
  {
    HAL_GPIO_WritePin(ledsArray[i].Port, ledsArray[i].Pin, GPIO_PIN_RESET);
  }
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    Sequence_Handler_FSM();
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART2;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 38400;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, LD2_Pin|LED1_Pin|LED2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, LED3_Pin|LED4_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, LED5_Pin|LED6_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LD2_Pin LED1_Pin LED2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin|LED1_Pin|LED2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : LED3_Pin LED4_Pin */
  GPIO_InitStruct.Pin = LED3_Pin|LED4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : LED5_Pin LED6_Pin */
  GPIO_InitStruct.Pin = LED5_Pin|LED6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == B1_Pin)
    {
        static uint32_t lastInterruptTick = 0;
        uint32_t currentInterruptTick = HAL_GetTick();
        /* Debounce por software: evita falsos disparos por ruido eléctrico (250 ms) */
        if ((currentInterruptTick - lastInterruptTick) > 250U)
        {
            sequence++;
        }
        lastInterruptTick = currentInterruptTick;
    }
}

void Sequence_1(void)
{
    if ((HAL_GetTick() - lastTick) >= DURANTION_SEQUENCE_1)
    {
      lastTick = HAL_GetTick();

      // Turn off the previous LED
      previousLed = (currentLed == 0) ? (LEDS_QTY - 1) : currentLed - 1;
      HAL_GPIO_WritePin(ledsArray[previousLed].Port, ledsArray[previousLed].Pin, GPIO_PIN_RESET);

      // Turn on the current LED
      HAL_GPIO_WritePin(ledsArray[currentLed].Port, ledsArray[currentLed].Pin, GPIO_PIN_SET);

      currentLed = (currentLed + 1) % LEDS_QTY;
    }
}

void Sequence_2(void)
{
    if ((HAL_GetTick() - lastTick) >= DURANTION_SEQUENCE_1)
    {
      lastTick = HAL_GetTick();

      // Turn off the previous LED
      previousLed = (currentLed == (LEDS_QTY - 1)) ? 0 : currentLed + 1;
      HAL_GPIO_WritePin(ledsArray[previousLed].Port, ledsArray[previousLed].Pin, GPIO_PIN_RESET);

      // Turn on the current LED
      HAL_GPIO_WritePin(ledsArray[currentLed].Port, ledsArray[currentLed].Pin, GPIO_PIN_SET);

      currentLed = (currentLed + LEDS_QTY - 1) % LEDS_QTY;
    }
}

/**
  * @brief  Secuencia 3: Efecto Ping-Pong (de izquierda a derecha y viceversa).
  */
void Sequence_3(void)
{
    if ((HAL_GetTick() - lastTick) >= DURANTION_SEQUENCE_1)
    {
        lastTick = HAL_GetTick();
        // 1. Apagar el LED que estaba encendido en el ciclo anterior
        HAL_GPIO_WritePin(ledsArray[previousLed].Port, ledsArray[previousLed].Pin, GPIO_PIN_RESET);
        // 2. Encender el LED actual
        HAL_GPIO_WritePin(ledsArray[currentLed].Port, ledsArray[currentLed].Pin, GPIO_PIN_SET);
        // 3. Guardar el LED actual como el anterior para apagarlo en el próximo tick
        previousLed = currentLed;
        // 4. Calcular el siguiente LED y dirección para el próximo ciclo
        if (ledDirection == 0) // Derecha (Ascendente)
        {
            currentLed++;
            if (currentLed == LEDS_QTY - 1)
            {
                ledDirection = 1; // Llegamos al final, invertir a la izquierda
            }
        }
        else // Izquierda (Descendente)
        {
            currentLed--;
            if (currentLed == 0)
            {
                ledDirection = 0; // Llegamos al inicio, invertir a la derecha
            }
        }
    }
}

void Sequence_Handler_FSM(void)
{
    uint32_t currentTick = HAL_GetTick();
    currentState = sequence % SEQUENCE_QTY;

    if (currentState != previousState)
    {
        lastTick = currentTick;
        previousState = currentState;

        // Apagar todos los LEDs de la secuencia anterior para una transición limpia
        for (uint8_t i = 0; i < LEDS_QTY; i++)
        {
            HAL_GPIO_WritePin(ledsArray[i].Port, ledsArray[i].Pin, GPIO_PIN_RESET);
        }

        // Inicializar el LED inicial para la nueva secuencia
        if (currentState == 0)
        {
            currentLed = 0; // Secuencia 1 inicia en el primer LED
        } 
        else if (currentState == 1)
        {
            currentLed = LEDS_QTY - 1; // Secuencia 2 inicia en el último LED (5)
        }
        else if (currentState == 2)
        {
            currentLed = 0;
            previousLed = LEDS_QTY - 1; 
            ledDirection = 0;           
        }
    }



    switch(currentState)
    {
        case 0:
            Sequence_1();
            break;
        
        case 1:
            Sequence_2();
            break;

        case 2:
            Sequence_3();
            break;
            
        default:
            Sequence_1();
            break;
    }

}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
